VibeCoding-tw/esp32c3-launcher/src/main.cpp
// --- OTA 邏輯 ---
void vTaskUpdate(void *pvParameters) {
    isUpdating = true;
    Serial.println("\n[Update] Background OTA Task Started.");
    BLEDevice::deinit(true); 
    delay(1000);
    
    char* url = (char*)pvParameters;
    WiFiClientSecure client;
    client.setInsecure();
    HTTPClient http;
    http.setFollowRedirects(HTTPC_STRICT_FOLLOW_REDIRECTS);
    
    if (http.begin(client, url)) {
        int httpCode = http.GET();
        if (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY) {
            int len = http.getSize();
            const esp_partition_t* part = esp_partition_find_first(ESP_PARTITION_TYPE_APP, ESP_PARTITION_SUBTYPE_APP_FACTORY, NULL);
            if (len > 0 && part) {
                esp_ota_handle_t update_handle = 0;
                if (esp_ota_begin(part, OTA_SIZE_UNKNOWN, &update_handle) == ESP_OK) {
                    WiFiClient* stream = http.getStreamPtr();
                    size_t written = 0;
                    uint8_t buff[2048];
                    while (http.connected() && (written < len)) {
                        size_t avail = stream->available();
                        if (avail) {
                            int c = stream->readBytes(buff, min(avail, (size_t)2048));
                            esp_ota_write(update_handle, buff, c);
                            written += c;
                            if (written % 51200 == 0) Serial.printf("Progress: %u%%\r", (written * 100) / len);
                        }
                        vTaskDelay(1);
                    }
                    if (written == len) {
                        esp_ota_end(update_handle);
                        esp_ota_set_boot_partition(part);
                        Serial.println("\n✅ Update Success! Restarting...");
                        delay(1000); ESP.restart();
                    }
                }
            }
        }
        http.end();
    }
    isUpdating = false;
    vTaskDelete(NULL);
}

void performGitHubCloudUpdate() {
    if (isUpdating) return;
    static char url[] = "https://github.com/VibeCoding-tw/esp32c3-launcher/releases/latest/download/firmware.bin";
    xTaskCreatePinnedToCore(vTaskUpdate, "OTA", 8192, (void*)url, 1, NULL, 1);
}

void checkAndPerformAutoUpdate() {
    if (motorConfig.autoUpdateEnabled != 1) return;
    WiFiClientSecure client; client.setInsecure();
    HTTPClient http; http.setFollowRedirects(HTTPC_STRICT_FOLLOW_REDIRECTS);
    if (http.begin(client, "https://github.com/VibeCoding-tw/esp32c3-launcher/releases/latest/download/version.txt")) {
        if (http.GET() == HTTP_CODE_OK) {
            String remote = http.getString(); remote.trim();
            if (remote != CURRENT_VERSION && remote.length() > 0) performGitHubCloudUpdate();
        }
        http.end();
    }
}

// --- 馬達與配置 ---
void loadMotorConfig() {
    preferences.begin("motor-config", true);
    if (preferences.getBytes("config", &motorConfig, sizeof(MotorConfig_t)) != sizeof(MotorConfig_t)) {
        motorConfig = {500, 2000, 200, 3, 60, 255, 20, 120, 1, 0};
    }
    preferences.end();
}
void saveMotorConfig() {
    preferences.begin("motor-config", false);
    preferences.putBytes("config", &motorConfig, sizeof(MotorConfig_t));
    preferences.end();
}

void setMotorPwm(int t, int s) {
    if (t > 0) { ledcWrite(LEDC_CH_A2, 0); ledcWrite(LEDC_CH_A1, t); }
    else if (t < 0) { ledcWrite(LEDC_CH_A1, 0); ledcWrite(LEDC_CH_A2, -t); }
    else { ledcWrite(LEDC_CH_A1, 0); ledcWrite(LEDC_CH_A2, 0); }
    if (s > 0) { ledcWrite(LEDC_CH_B1, 0); ledcWrite(LEDC_CH_B2, s); }
    else if (s < 0) { ledcWrite(LEDC_CH_B2, 0); ledcWrite(LEDC_CH_B1, -s); }
    else { ledcWrite(LEDC_CH_B1, 0); ledcWrite(LEDC_CH_B2, 0); }
}

void motorRampTask() {
    if (millis() - lastRampTime < 10) return;
    lastRampTime = millis();
    if (targetSpeedT == 0) currentSpeedT = 0;
    else {
        if (currentSpeedT == 0) currentSpeedT = (targetSpeedT > 0) ? motorConfig.pwmStartKickT : -motorConfig.pwmStartKickT;
        int diff = targetSpeedT - currentSpeedT;
        if (abs(diff) <= motorConfig.rampAccelStepT) currentSpeedT = targetSpeedT;
        else currentSpeedT += (diff > 0) ? motorConfig.rampAccelStepT : -motorConfig.rampAccelStepT;
    }
    if (targetSpeedS == 0) currentSpeedS = 0;
    else {
        if (currentSpeedS == 0) currentSpeedS = (targetSpeedS > 0) ? motorConfig.pwmStartKickS : -motorConfig.pwmStartKickS;
        int diff = targetSpeedS - currentSpeedS;
        if (abs(diff) <= motorConfig.rampAccelStepS) currentSpeedS = targetSpeedS;
        else currentSpeedS += (diff > 0) ? motorConfig.rampAccelStepS : -motorConfig.rampAccelStepS;
    }
    currentSpeedT = constrain(currentSpeedT, -motorConfig.pwmEffectiveLimitT, motorConfig.pwmEffectiveLimitT);
    currentSpeedS = constrain(currentSpeedS, -motorConfig.pwmEffectiveLimitS, motorConfig.pwmEffectiveLimitS);
    setMotorPwm(currentSpeedT, currentSpeedS);
}

void updateBatteryVoltage() {
    if (millis() - lastBatteryCheck < 500) return;
    lastBatteryCheck = millis();
    float v = (analogRead(BATT_ADC_PIN) / 4095.0) * 3.1 * 2.0;
    if (batteryVoltage < 0.1) batteryVoltage = v;
    else batteryVoltage = batteryVoltage * 0.9 + v * 0.1;
}

// --- Web Handlers ---
void handleRoot() { server.sendHeader("Connection", "close"); String h=DPAD_PAGE_HTML; h.replace("%VERSION%", CURRENT_VERSION); server.send(200, "text/html", h); }
void handleJoystick() { server.sendHeader("Connection", "close"); String h=JOYSTICK_PAGE_HTML; h.replace("%VERSION%", CURRENT_VERSION); server.send(200, "text/html", h); }
void handleControl() {
    if (server.hasArg("t") && server.hasArg("s")) {
        targetSpeedT = server.arg("t").toInt(); targetSpeedS = server.arg("s").toInt();
        lastControlTime = millis();
        String json = "{\"v\":"+String(batteryVoltage,2)+",\"rt\":"+String(currentSpeedT)+",\"rs\":"+String(currentSpeedS)+"}";
        server.send(200, "application/json", json);
    }
}
void handleFactoryUpdate() { server.sendHeader("Connection", "close"); server.send(200, "text/html", MAINTENANCE_PAGE_HTML); }
void handleGitHubUpdate() { server.send(200, "text/html", UPDATE_PAGE_HTML); delay(500); performGitHubCloudUpdate(); }
void handleToggleAutoUpdate() { motorConfig.autoUpdateEnabled = !motorConfig.autoUpdateEnabled; saveMotorConfig(); server.sendHeader("Location", "/update_factory"); server.send(303); }

