VibeCoding-tw/esp32c3-launcher/src/main.cpp
// --- BLE Callbacks ---
class MyServerCallbacks: public BLEServerCallbacks {
    void onConnect(BLEServer* p) { Serial.println("BLE Connected."); }
    void onDisconnect(BLEServer* p) { should_restart_advertising = true; }
};

class MyCharCallbacks: public BLECharacteristicCallbacks {
    void onWrite(BLECharacteristic* p) {
        std::string val = p->getValue();
        if (val.length() > 0) {
            String cmd = String(val.c_str());
            int idx = cmd.indexOf(',');
            if (idx > 0) { 
                targetSpeedT = cmd.substring(0, idx).toInt(); 
                targetSpeedS = cmd.substring(idx + 1).toInt(); 
                lastControlTime = millis(); 
            }
        }
    }
};

// [NEW] WiFi SSID 讀取/寫入回調
class WiFiSsidCallbacks: public BLECharacteristicCallbacks {
    void onRead(BLECharacteristic* p) {
        preferences.begin("wifi-config", true);
        String s = preferences.getString("ssid", "");
        preferences.end();
        p->setValue(s.c_str());
    }
    void onWrite(BLECharacteristic* p) {
        std::string val = p->getValue();
        if (val.length() > 0) {
            ble_ssid = String(val.c_str());
            Serial.printf("BLE: Received SSID: %s\n", ble_ssid.c_str());
        }
    }
};

// [NEW] WiFi Password 讀取/寫入回調
class WiFiPassCallbacks: public BLECharacteristicCallbacks {
    void onRead(BLECharacteristic* p) {
        preferences.begin("wifi-config", true);
        String p_val = preferences.getString("pass", "");
        preferences.end();
        p->setValue(p_val.c_str());
    }
    void onWrite(BLECharacteristic* p) {
        std::string val = p->getValue();
        if (val.length() > 0) {
            ble_pass = String(val.c_str());
            Serial.println("BLE: Received Password. Saving WiFi config...");
            preferences.begin("wifi-config", false);
            preferences.putString("ssid", ble_ssid);
            preferences.putString("pass", ble_pass);
            preferences.end();
            Serial.println("✅ WiFi Config Saved. Restarting in 2s...");
            delay(2000);
            ESP.restart();
        }
    }
};

// [NEW] 馬達組態 (28-byte) 讀取/寫入回調
class MotorConfigCallbacks: public BLECharacteristicCallbacks {
    void onRead(BLECharacteristic* p) {
        p->setValue((uint8_t*)&motorConfig, sizeof(MotorConfig_t));
    }
    void onWrite(BLECharacteristic* p) {
        std::string rxValue = p->getValue();
        if (rxValue.length() == sizeof(MotorConfig_t)) {
            memcpy(&motorConfig, rxValue.data(), sizeof(MotorConfig_t));
            saveMotorConfig();
            Serial.println("✅ Motor Config updated via BLE.");
        }
    }
};

void setupBleServer_Bluedroid() {
    BLEDevice::init(globalHostname.c_str());
    pServer = BLEDevice::createServer();
    pServer->setCallbacks(new MyServerCallbacks());

    // 1. 馬達服務 (控制 + 組態)
    BLEService *pSvcMotor = pServer->createService(MOTOR_SERVICE_UUID);
    
    // 控制特徵值 (T,S 字串)
    pControlCharacteristic = pSvcMotor->createCharacteristic(
        MOTOR_CONTROL_CHAR_UUID, 
        BLECharacteristic::PROPERTY_WRITE
    );
    pControlCharacteristic->setCallbacks(new MyCharCallbacks());

    // 組態特徵值 (28-byte Binary)
    pMotorConfigCharacteristic = pSvcMotor->createCharacteristic(
        MOTOR_CONFIG_CHAR_UUID,
        BLECharacteristic::PROPERTY_READ | BLECharacteristic::PROPERTY_WRITE
    );
    pMotorConfigCharacteristic->setCallbacks(new MotorConfigCallbacks());
    pSvcMotor->start();

    // 2. 設定服務 (WiFi)
    BLEService *pSvcConfig = pServer->createService(CONFIG_SERVICE_UUID);
    
    pSsidCharacteristic = pSvcConfig->createCharacteristic(
        SSID_CHAR_UUID,
        BLECharacteristic::PROPERTY_READ | BLECharacteristic::PROPERTY_WRITE
    );
    pSsidCharacteristic->setCallbacks(new WiFiSsidCallbacks());

    pPassCharacteristic = pSvcConfig->createCharacteristic(
        PASS_CHAR_UUID,
        BLECharacteristic::PROPERTY_READ | BLECharacteristic::PROPERTY_WRITE
    );
    pPassCharacteristic->setCallbacks(new WiFiPassCallbacks());
    pSvcConfig->start();

    // 廣播設定
    BLEAdvertising *pAdv = BLEDevice::getAdvertising();
    pAdv->addServiceUUID(MOTOR_SERVICE_UUID);
    pAdv->addServiceUUID(CONFIG_SERVICE_UUID);
    pAdv->start();
    
    Serial.println("🤖 BLE Services (Motor + WiFi Config) Started.");
}

void onWsEvent(uint8_t num, WStype_t type, uint8_t * payload, size_t length) {
    if (type == WStype_TEXT) {
        String msg = String((char*)payload);
        int idx = msg.indexOf(',');
        if (idx > 0) { targetSpeedT = msg.substring(0,idx).toInt(); targetSpeedS = msg.substring(idx+1).toInt(); lastControlTime = millis(); }
    }
}

void checkUdpControl() {
    if (udp.parsePacket()) {
        char b[32]; int l = udp.read(b,31); b[l]=0; String msg=String(b);
        int idx = msg.indexOf(',');
        if (idx > 0) { targetSpeedT = msg.substring(0,idx).toInt(); targetSpeedS = msg.substring(idx+1).toInt(); lastControlTime = millis(); }
    }
}

void generateHostname() {    
    globalHostname = "esp32c3-" + WiFi.macAddress(); 
    globalHostname.replace(":", ""); 
    globalHostname.toLowerCase(); 
    Serial.printf("Generated Hostname: %s\n", globalHostname.c_str());
}
void connectToSavedWiFi() {
    preferences.begin("wifi-config", true); String s = preferences.getString("ssid",""); String p = preferences.getString("pass",""); preferences.end();
    if (s.length()>0) { WiFi.mode(WIFI_STA); WiFi.begin(s.c_str(), p.c_str()); }
}

void setup() {
    Serial.begin(115200); loadMotorConfig();
    pinMode(NSLEEP_PIN, OUTPUT); digitalWrite(NSLEEP_PIN, HIGH);
    ledcSetup(LEDC_CH_A1, 20000, 8); ledcSetup(LEDC_CH_A2, 20000, 8);
    ledcSetup(LEDC_CH_B1, 20000, 8); ledcSetup(LEDC_CH_B2, 20000, 8);
    ledcAttachPin(AIN1_PIN, LEDC_CH_A1); ledcAttachPin(AIN2_PIN, LEDC_CH_A2);
    ledcAttachPin(BIN1_PIN, LEDC_CH_B1); ledcAttachPin(BIN2_PIN, LEDC_CH_B2);
    analogReadResolution(12); generateHostname(); setupBleServer_Bluedroid(); connectToSavedWiFi();
}

void loop() {
    if (servicesStarted) {
        webSocket.loop();
        checkUdpControl();
        server.handleClient();
    }
    if (WiFi.status() == WL_CONNECTED && !servicesStarted) {
        MDNS.begin(globalHostname.c_str());
        server.on("/", handleRoot); server.on("/joystick", handleJoystick); server.on("/control", handleControl);
        server.on("/update_factory", handleFactoryUpdate); server.on("/update_github", handleGitHubUpdate);
        server.on("/toggle_auto_update", handleToggleAutoUpdate);
        server.begin(); webSocket.begin(); webSocket.onEvent(onWsEvent); udp.begin(UDP_PORT);
        servicesStarted = true; checkAndPerformAutoUpdate();
    }
    if (servicesStarted) server.handleClient();
    if (!isUpdating) { motorRampTask(); updateBatteryVoltage(); if(millis()-lastControlTime>1000){targetSpeedT=0;targetSpeedS=0;} }
    if (should_restart_advertising && pServer) { pServer->startAdvertising(); should_restart_advertising = false; }
    delay(1);
}
